# ColumnBaseAboveTopFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnFailures..::..ColumnBaseAboveTopFailure Property
BuiltInFailures..::..ColumnFailures Class See Also
---
The column base can't be moved above its top.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnBaseAboveTopFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnBaseAboveTopFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnBaseAboveTopFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnFailures Class
Autodesk.Revit.DB Namespace